Variables/NewAccount_SFF.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://th/co/ais/sff/ws" xmlns:java="java:th.co.ais.sff.domain.gm.vo.ws">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:ExecuteService>
            <ws:sffRequest>
                <java:Event>evAMCreateNewAccount</java:Event>
                <java:ParameterList>
                    <java:Parameter>
                        <java:Name>accountType</java:Name>
                        <java:Value>{{accountType}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>saNumber</java:Name>
                        <java:Value>{{saNumber}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>accountCat</java:Name>
                        <java:Value>{{accountCat}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>accountSubCat</java:Name>
                        <java:Value>{{accountSubCat}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>idCardType</java:Name>
                        <java:Value>{{idCardType}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>idCardNo</java:Name>
                        <java:Value>{{idCardNo}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>title</java:Name>
                        <java:Value>{{title}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>firstName</java:Name>
                        <java:Value>{{firstName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>lastName</java:Name>
                        <java:Value>{{lastName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>saleRepName</java:Name>
                        <java:Value>{{saleRepName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>emailAddress</java:Name>
                        <java:Value>{{emailAddress}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>homeNo</java:Name>
                        <java:Value>{{homeNo}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>buildingName</java:Name>
                        <java:Value>{{buildingName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>floor</java:Name>
                        <java:Value>{{floor}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>room</java:Name>
                        <java:Value>{{room}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>moo</java:Name>
                        <java:Value>{{moo}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>mooBan</java:Name>
                        <java:Value>{{mooBan}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>soi</java:Name>
                        <java:Value>{{soi}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>street</java:Name>
                        <java:Value>{{street}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>tumbol</java:Name>
                        <java:Value>{{tumbol}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>amphur</java:Name>
                        <java:Value>{{amphur}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>province</java:Name>
                        <java:Value>{{province}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>zipCode</java:Name>
                        <java:Value>{{zipCode}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>userName</java:Name>
                        <java:Value>{{userName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>channel</java:Name>
                        <java:Value>{{channel}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>mainMobileNo</java:Name>
                        <java:Value>{{mainMobileNo}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>invoicingCompany</java:Name>
                        <java:Value>{{invoicingCompany}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>overrideProfileFlag</java:Name>
                        <java:Value>{{overrideProfileFlag}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>accountName</java:Name>
                        <java:Value>{{accountName}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>taxPaperFlag</java:Name>
                        <java:Value>{{taxPaperFlag}}</java:Value>
                    </java:Parameter>
                    <java:Parameter>
                        <java:Name>accntSource</java:Name>
                        <java:Value>{{accntSource}}</java:Value>
                    </java:Parameter>
                </java:ParameterList>
            </ws:sffRequest>
        </ws:ExecuteService>
    </soapenv:Body>
</soapenv:Envelope>