ChangeFormatXML/oldxml_SFFXML.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://th/co/ais/sff/ws" xmlns:java="java:th.co.ais.sff.domain.gm.vo.ws">
	<soapenv:Header/>
	<soapenv:Body>
		<ws:ExecuteService>
			<ws:sffRequest>
				<java:Event>evOMServiceConfirmChangePromotion</java:Event>
				<java:ParameterList>
					<java:ParameterType/>
					<java:Parameter>
						<java:Name>orderType</java:Name>
						<java:Value>Change Promotion</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>mobileNo</java:Name>
						<java:Value>0921306380</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>orderChannel</java:Name>
						<java:Value>MYA</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>orderReason</java:Name>
						<java:Value>956</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>userName</java:Name>
						<java:Value>SFFIVR</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>chargeFeeFlag</java:Name>
						<java:Value>Y</java:Value>
					</java:Parameter>
					<java:Parameter>
						<java:Name>ascCode</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>locationCd</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>club900Mobile</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>accessNo</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>referenceNo</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>campaignAFP</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>clickRefAFP</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>platformAFP</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:Parameter>
						<java:Name>pubIdAFP</java:Name>
						<java:Value/>
					</java:Parameter>
					<java:ParameterList>
						<java:ParameterType/>
						<java:Parameter>
							<java:Name>promotionCode</java:Name>
							<java:Value>P210808084</java:Value>
						</java:Parameter>
						<java:Parameter>
							<java:Name>actionStatus</java:Name>
							<java:Value>Add</java:Value>
						</java:Parameter>
						<java:Parameter>
							<java:Name>productSeq</java:Name>
							<java:Value/>
						</java:Parameter>
						<java:Parameter>
							<java:Name>promotionStartDt</java:Name>
							<java:Value/>
						</java:Parameter>
						<java:Parameter>
							<java:Name>promotionEndDt</java:Name>
							<java:Value/>
						</java:Parameter>
						<java:Parameter>
							<java:Name>overRuleStartDate</java:Name>
							<java:Value>I</java:Value>
						</java:Parameter>
						<java:Parameter>
							<java:Name>waiveFlag</java:Name>
							<java:Value/>
						</java:Parameter>
						<java:Parameter>
							<java:Name>vatAmt</java:Name>
							<java:Value/>
						</java:Parameter>
					</java:ParameterList>
				</java:ParameterList>
			</ws:sffRequest>
		</ws:ExecuteService>
	</soapenv:Body>
</soapenv:Envelope>
